#!/usr/bin/python3

import os
import pickle
from pathlib import Path

server_data = {
        "5053": {
            "name" : "瑪拉頓",
            "userlist" : ["1396448", "1254127", "1284707", "1506151","1217075","1033941", "1510869", "1516388", "994406", "1644080", "1100596", "1679238", "1592486", "459700", "1932774", "1780465", "1966705", "1274742", "2021903", "1471157", "1932774", "2046272", "1160081", "1783050", "613972", "1557013", "2076848", "1849379", "1741209", "1684006", "1110635", "2032618", "1580093", "1558031", "1995218", "1108651", "1041090", "1450686", "2061123", "1101547", "1208223", "1067363", "1439087", "1333185", "431198", "1519927", "1742519", "738386", "1777132", "345037", "1889992", "2026353", "1045968", "1179032", "1783050", "1447379", "1752135", "854230", "963427", "849154", "1565957", "1020303", "2170057", "1604940", "1850649", "2156681", "2153457", "1521093", "2145924", "1148152", "2143431", "1590024", "1693368", "1327704", "1122232", "2121080", "1828629", "1194654", "1048134", "2004536", "1668522", "1747024", "1702866", "2161031", "2130700", "1458866", "478554", "1443886", "1932334", "142541", "1899025", "713907", "2273649", "2218780", "2183058", "1713087", "1119328", "595996", "173402", "1589541", "978261", "604149", "5992", "2291649", "1159031"],
            "guildlist": ["無與倫比的自由", "MyGO!!!!!", "Ice Crown", "喵喵叫的小伙伴们", "風月衝鋒團", "上海问题青年", "微风再拂", "黄昏酒馆", "逆天", "★逆天★", "Impact", "老年混子團", "Manny Club 亚服", "鷄戰", "FriendShipClub", "小喬流水人傢", "雲頂小築", "明儿有雨", "广电总局", "南瓜小学丶学前班", "龍 門", "肥腸", "福尔图娜", "老兵亞服分會", "★風月同天★", "天空之墙", "嘎了給給", "膘巴>達", "无册么赫", "死亡之翼", "我真的没有骗你", "家园-玛拉顿", "甘寧周罵渡假村", "爲你寫詩", "奧斯卡演員", "魔界炎帝", "倚竹醉酒笑紅塵", "卓越漂流", "IKEA of Avalon", "好久不見", "餐桌騎士團", "無與倫比的自由", "貪婪的冒險者", "广电总局", "小夜的各種團本記錄檔"]
            },
        "5052": {
            "name" : "伊弗斯",
            "userlist" : ["1231180", "973644", "690499", "1621735", "1022502", "1896889", "973235", "1014893", "1051256", "1965079", "2237696"],
            "guildlist": ["Noobs Int", "万焰公会", "荣耀", "大雷瓜棚", "猫窝", "超越周四团（+V：jerry6630）", "Everything In The Dream", "永遠叫不醒一個裝睡的人", "起点远>征军", "年糕乐园", "鸽们-伊弗斯", "艾歐尼亞天空-伊弗斯", "世2鸟哈神的水友团", "SSIS-413", "亞服10人團", "少年遊", "細雨紛飛", "八卦集中營", "唷唷", "No Fear 2.0", "Asgard备战ICC招DK/SS，微信号15111353582", "Aurora", "IFC1", "雁渡寒潭", "等下要吃什麼", "倚楼听風雨（亚服）", "二萬二良心企業", "Rbae Style", "凑拢班子", "你想證明什麼", "八点整", "微醺沙發", "索爾的一棟城堡", "A Star", "贝塔β招募+V：PoP-SteP", "熊克萨的春天", "夜半時光", "安西軍", "阿魯", "Play for uber", "Ouroboros", "MIKO", "吃瓜真香", "300 P", "鵝魚我炸", "OOPS 10人團", "RL每次都搞", "滿滿和她的男人們", "浪團", "Fertty", "Source of Chaos 週四團", "Source of Chaos 2團", "你有棒子我有故事當我們都在小圈圈", "Pepe & Sausage", "Source of Chaos", "胖丁金團", "Meteora", "Hall of Fame"],
            },
        "5205": {
            "name" : "烏蘇雷",
            "userlist" : ["1896889", "486041", "1535244", "2371907", "1052681", "902871", "353477", "2249924", "859477", "642089", "310995"],
            "guildlist": ["Nuke-鸽王争霸", "伊卡洛斯和他的伙伴们", "Dark Tranquillity", "离殇", "P A S", "Meow Boss Gaming", "yseraskyCTM", "The Ran Beach Legion", "Hey Chocolate", "黑手兄弟會", "小喵团台服分舵", "至死不渝", "金陵世家 霜月团", "DrumstickG团", "寒脊山之光", "永 夜 休闲团", "无糖乌苏雷四海为家", "无>糖乌苏雷", "小拳拳幫", "缘起", "鹅城", "誠 諾灬烏蘇雷", "乌鸦团", "千钧一发台服", "颤粟-乌蘇雷", "伊卡洛斯的小伙伴", "LSP驻台办", "为了方便吹逼迫不得已组建的工会", "远征-乌苏雷", "大聪明", "in time", "隨便拉", "marsh", "炎魔之灵"],
            },
        }

for server in server_data:
    if not os.path.isdir(server):
        os.mkdir(server)

    pickle.dump(server_data[server]["name"], open('%s/name.pkl' % server, 'wb'))
    if server_data[server]["userlist"]:
        Path(server).mkdir(parents=True, exist_ok=True)
        pickle.dump(server_data[server]["userlist"], open('%s/userlist.pkl' % server, 'wb'))
        print(pickle.load(open('%s/userlist.pkl' % server, 'rb')))
    if server_data[server]["guildlist"]:
        Path(server).mkdir(parents=True, exist_ok=True)
        pickle.dump(server_data[server]["guildlist"], open('%s/guildlist.pkl' % server, 'wb'))
        print(pickle.load(open('%s/guildlist.pkl' % server, 'rb')))

